BoundaryTests/02Tests/totalPressureSpeed/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m s^-1];

internalField   uniform (0.2 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    /* inlet
    {
        type            fixedValue;
        value           uniform (15 0 0);
    } */

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        //value           $internalField;
    }

    walls
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }
    
    cyclicFaces_master
    {
        type            cyclic;
    }

    cyclicFaces_slave
    {
        type            cyclic;
    }
}


// ************************************************************************* //
